/*-----------------------------------------------
  名称：IO口高低电平控制
  编写：sandman
  日期：2016.4.24
  修改：无
  内容：点亮P1口的多个LED灯闪烁
        该程序是单片机学习中最简单最基础的，
		通过程序了解如何控制端口的高低电平
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

sbit LED0=P0^0;// 用sbit 关键字 定义 LED到P0.0端口，LED是自己任意定义且容易记忆的符号
sbit LED1=P0^1;
sbit LED2=P0^2;
sbit LED3=P0^3;
sbit LED4=P0^4;
sbit LED5=P0^5;
sbit LED6=P0^6;
sbit LED7=P0^7;

void Delay(unsigned int t); //函数声明
/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main (void)
{
                  //此方法使用bit位对单个端口赋值
unsigned char i;  //定义一个无符号字符型局部变量 i 取值范围 0~255

while (1)         //主循环
  {
 for(i=0;i<=5;i++)   //加入 for循环，表明for循环大括号中
					 //的程序循环执行10次
  {
  LED0=0;
  LED1=1;            //将P0.0口赋值 0，对外输出低电平
  LED2=0;
  LED3=1;
  LED4=0;
  LED5=1;
  LED6=0;
  LED7=1;
  Delay(35000);      //调用延时程序；更改延时数字可以更改延时长度；
					//用于改变闪烁频率
  LED0=1;
  LED1=0;           //将P0.0口赋值 1，对外输出高电平
  LED2=1;
  LED3=0;
  LED4=1;
  LED5=0;
  LED6=1;
  LED7=0;                
  Delay(50000);
  }

 for(i=0;i<=5;i++)
  {
  LED0=0;
  LED1=1;            //将P0.0口赋值 0，对外输出低电平
  LED2=0;
  LED3=1;
  LED4=0;
  LED5=1;
  LED6=0;
  LED7=1;
  Delay(35000);      //调用延时程序；更改延时数字可以更改延时长度；
					 //用于改变闪烁频率
  LED0=1;
  LED1=0;           //将P0.0口赋值 1，对外输出高电平
  LED2=1;
  LED3=0;
  LED4=1;
  LED5=0;
  LED6=1;
  LED7=0;                

  Delay(50000);      
  }
                     //主循环中添加其他需要一直工作的程序
 }
}
/*------------------------------------------------
 延时函数，含有输入参数 unsigned int t，无返回值
 unsigned int 是定义无符号整形变量，其值的范围是
 0~65535
------------------------------------------------*/
void Delay(unsigned int t)
{
 while(--t);
}